Revit 2024 API
GroupTypeId.PrimaryUnits Property
 Primary Units.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId PrimaryUnits { get; }
Visual Basic
Public Shared ReadOnly Property PrimaryUnits As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ PrimaryUnits {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace